# money = 780
# #500원 - 1 100원 2개 50원 1개 10원 3개
# print("500원 동전개수:",money//500)
# print("100원 동전개수:",(money%500)//100)
# print("50원 동전개수:",(money%500)%100//50)
# print("10원 동전개수:",((money%500)%100)%50//10)


# money = 1759870
# # 5만원권, 1만원권, 5천원권, 1천원권, 500원권, 100원권, 50원권, 10원권
# print("5만원 :",money//50000)
# print("1만원 :",(money%50000)//10000)
# print("5천원 :",(money%50000)%10000//5000)
# print("1천원 :",((money%50000)%10000)%5000//1000)
# print("500원 :",(((money%50000)%10000)%5000)%1000//500)
# print("100원 :",((((money%50000)%10000)%5000)%1000)%500//100)
# print("50원 :",(((((money%50000)%10000)%5000)%1000)%500)%100//50)
# print("10원 :",((((((money%50000)%10000)%5000)%1000)%500)%100)%50//10)



#1759870
#9870
#590
#위 가격들을 넣었을때 지폐단위로 끊어서 출력시켜보셈

str1 = input("문자를 넣으시오.")
a = len(str1) #문자의 길이 .length
if a==5:
  print("a는 5입니다.")
elif a==4: #else if
  print("a는 4입니다.")
elif a==3:
  print("a는 3입니다.")
else:
  print("a 숫자는 2이하입니다.")


# str01 = input("가격을 넣으시오.")

# if 


money = int(input("가격을 넣으라"))
print("5만원 :",money//50000)
print("1만원 :",(money%50000)//10000)
print("5천원 :",(money%50000)%10000//5000)
print("1천원 :",((money%50000)%10000)%5000//1000)
print("500원 :",(((money%50000)%10000)%5000)%1000//500)
print("100원 :",((((money%50000)%10000)%5000)%1000)%500//100)
print("50원 :",(((((money%50000)%10000)%5000)%1000)%500)%100//50)
print("10원 :",((((((money%50000)%10000)%5000)%1000)%500)%100)%50//10)



